Autodesk.Revit.DB.DirectContext3D.VertexFormatBits
Vertex format (i.e., the type of data associated with a vertex) represented as a number.
Remarks:
VertexFormatBits can be used to specify the vertex format in the creation of the following objects:
Autodesk.Revit.DB.DirectContext3D.EffectInstanceAutodesk.Revit.DB.DirectContext3D.VertexFormat
VertexFormatBits is not to be confused with VertexFormat. The latter type of object is associated with low-level graphics
functionality and may become invalid. VertexFormat is needed to submit a set of vertex and index buffers for rendering (see
Autodesk.Revit.DB.DirectContext3D.DrawContext).
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.PositionNormalColored
Vertex format consisting of a position, a normal vector, and a color.

Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.PositionColored
Vertex format consisting of a position and a color.

Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.PositionNormal
Vertex format consisting of a position and a normal vector.

Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.Position
Vertex format consisting of a position.